{
  "author": "CinemaSerf",
  "author_details": {
    "name": "CinemaSerf",
    "username": "Geronimo1967",
    "avatar_path": "/1kks3YnVkpyQxzw36CObFPvhL5f.jpg",
    "rating": 5
  },
  "content": "There are a few scenes in this that are vaguely menacing, but for the most part it is really, really poor! Idris Elba (\"Nate\") arrives with his daughters \"Mer\" (Iyana Halley) and \"Norah\" (Leah Jeffries) at at remote African game reserve run by his friend \"Martin\" (Sharlto Copley). Pretty soon we realise that the luggage they brought on the plane is but the tip of the iceberg of baggage that actually accompanied this family and we are quickly immersed in a rather unattractive melodrama surrounding his late wife who tragically passed away (hopefully before seeing this film). Anyway, they are out on a guided tour when they discover that all is not well - an huge rogue lion is out to avenge himself on humanity after a group of poachers annihilated his pride. Snacking with impunity, this lion is soon determined to make a meal of these travellers - but can they stay alive long enough for help to arrive? Elba struggles to deliver consistency with his rather un-necessary American accent, the two girls are frankly just annoying and from very early on, I was wholeheartedly on the side of the lion. Curiously (or fortunately for the narrative), this great beast has virtually no sense of smell so \"Nate\" and his offspring seem to manage to dice with death on an implausibly regular basis. Taking shelter in an old school - leaving all the doors open for added protection; getting in and out of their land cruiser with scant regard for their safety and armed with little more than a pen-knife. The dialogue is OK - that's because it says it over and over again... \"Are you OK?\" \"Are You OK\"? The last few scenes are just plain silly - indeed, they reminded me of my schoolboy enjoyment of \"Daktari\" (1966) with the friendly \"Clarence the cross-eyed lion\" married together with one of the those semi-educational Disney films with actuality interspersed into the fiction. It does have the benefit of being short - just the ninety minutes, but what action there is is all too often drowned out in the banal family drama that is just dull. Nobody's finest work, sorry...",
  "created_at": "2022-08-27T21:55:21.506Z",
  "id": "630a92c9b7d3520080a5b9b7",
  "updated_at": "2022-08-27T21:58:46.816Z",
  "url": "https://www.themoviedb.org/review/630a92c9b7d3520080a5b9b7"
}
